create database 상권강병관;

use 상권강병관;

create table 상권 (
		상가업소번호 int not null,
		상호명 char(30),
		상권업종대분류명 char(30),
		상권업종중분류명 char(30),
		상권업종소분류명 char(30),
		시군구명 char(20),
		행정동명 char(20),
		법정동명 char(20),
		경도 real,
		위도 real,
		primary key(상가업소번호)
		);

Insert Into 상권 values (17174175, '비지트', '음식', '한식', '한식/백반/한정식', '서초구', '방배4동', '방배동', 126.991394, 37.488375);
Insert Into 상권 values (17174119, '쓰리에프', '음식', '한식', '한식/백반/한정식', '동작구', '사당2동', '사당동', 126.980952, 37.487105);
Insert Into 상권 values (17174096, '채움', '음식', '한식', '한식/백반/한정식', '종로구', '종로1,2,3,4가동', '수송동', 126.981794, 37.572387);
Insert Into 상권 values (17174062, '호구의주방', '소매', '가정/주방/인테리어', '주방가구판매', '영등포구', '양평2동', '양평동4가', 126.897892, 37.536700);
Insert Into 상권 values (17174040, '다향', '음식', '한식', '한식/백반/한정식/', '서초구', '서초3동', '서초동', 127.009382, 37.483436);
Insert Into 상권 values (20741628, '행운노래연습장', '관광/여가/오락', '무도/유흥/가무', '노래방', '동대문구', '장안1동', '장안동', 127.064796, 37.562441);
Insert Into 상권 values (24676721, '힐리빙텔', '학문/교육', '도서관/독서실', '독서실', '서대문구', '신촌동', '대현동', 126.944057, 37.558414);
Insert Into 상권 values (20594635, '유림식당', '음식', '한식', '한식/백반/한정식', '은평구', '대조동', '대조동', 126.924365, 37.609397);
Insert Into 상권 values (20536992, '이삭토스트', '음식', '패스트푸드', '토스트전문', '양천구','목5동', '목동', 126.878696, 37.535600);
Insert Into 상권 values (20659878, '커피빈', '음식', '커피점/카페', '커피전문점/카페/다방', '종로구', '혜화동', '명륜4가', 127.000171, 37.583149);
Insert Into 상권 values (17174686, '왕십리제일곱창', '음식', '한식', '곱창/양구이전문', '성동구', '행당1동', '행당동', 127.036784, 37.564901);
Insert Into 상권 values (17175333, '흥부보쌈', '음식', '한식', '족발/보쌈전문',	'양천구', '목1동', '목동', 126.875987, 37.529132);
Insert Into 상권 values (22370147, '연세공인중개사사무소', '부동산', '부동산중개', '부동산중개', '은평구', '역촌동', '역촌동', 126.922323, 37.605891);
insert into 상권 values (17174967, '고수의족발', '음식', '한식', '족발/보쌈전문', '송파구', '문정1동', '문정동', 127.126606, 37.487100);
insert into 상권 values (17175311, '제이씨에스푸드', '음식', '한식', '한식/백반/한정식', '관악구', '서림동', '신림동', 126.937790, 37.471190);


Select *
From 상권;

-- #1. 상권업종소분류명에서 한정식을 포함하는 가게들을 구하시오.
Select *
From 상권
Where 상권업종소분류명 like '%한정식';


-- #2. 가게별 경도와 위도의 평균을 경위도를 구하시오.
Select AVG(경도) AS '경도평균', AVG(위도) AS '위도평균'
From 상권;


-- #3. 상권업종소분류명에서 한식으로 그룹핑

-- #문제 4. 시군구명이 서초구중에서, 법정동명이 방배동인 업소의 상호명과 상권업종중뷴류명을 나타내시오.

Select 상호명, 상권업종중분류명
From 상권 
Where          In (
				Select
				From 상권
				Where 
				);

-- #문제 5. 새로운 정보를 입력하시오. 
Insert Into 상권 values (17163092, '도전최강달인왕만두', '음식', '한식', '한식/백반/한정식', '강동구', '고덕2동', '고덕동',	127.159471,	37.556197);

Select *
From 상권;